# filename: camera_configs.py
import cv2
import numpy as np
# matlab
left_camera_matrix = np.array([[1133.34930310361,         0.794840993019255,          351.811321337681],
                               [0,          1137.52827962295,          310.633161064736],
                               [0,                         0,                         1]])
left_distortion = np.array([[0.123202384251622,	-5.16461429928527, 0.0262777345048959,	0.00863438226009910,	63.7776000931781]])

right_camera_matrix = np.array([[1132.07487014845,         -3.37083530869219,          353.501439997956],
                                [0,          1139.18778239876,          299.983946332228],
                                [0,                         0,                         1]])
right_distortion = np.array([[-0.155322847827833,	0.848569789158147,  0.0203939850092266,	-0.0132013608287500,	16.6201762437098]])

# vs2017
# left_camera_matrix = np.array([[1030.148756461102, 0., 310.1315120188951],
#                                [0., 1020.329481852786, 236.5041758344506],
#                                [0., 0., 1]])
# left_distortion = np.array([[2.202009895940103, -174.9375332907136, -0.009269015911687783, -0.02400892826406628, 3937.621385200167]])
#
# right_camera_matrix = np.array([[790.335070911311, 0., 293.8241803972662],
#                                 [0., 778.306767528208, 225.7986855375801],
#                                 [0., 0., 1]])
# right_distortion = np.array([[0.5810264615857057, -1.652930292577811, -0.009629683897928376, -0.07548632569165004, -345.5995868011018]])

# om = np.array([0.01911, 0.03125, -0.00960])  # 旋转关系向量
# om = np.array([[0.998936000294359,	-0.000235354410531013,	-0.0461173711762662],
#                [0.00265399672843330,	0.998623113475701,	0.0523911589246044],
#                [0.0460415422990318,	-0.0524578100991562,	0.997561203406752]])  # 旋转关系向量
# R = cv2.Rodrigues(om)[0]  # 使用Rodrigues变换将om变换为R
R = np.array([[0.999072289208487,      -0.00275547422235326,        0.0429763690593191],
              [0.00105392520850096,         0.999216436007433,       0.0395651772934012],
              [-0.0430517151501278,       -0.0394831783727365,         0.998292356200436]])

T = np.array([-50.1528719736805,	-0.685928802969056,	-1.68903372339033])  # 平移关系向量

size = (640, 480)  # 图像尺寸

# 进行立体更正
R1, R2, P1, P2, Q, validPixROI1, validPixROI2 = cv2.stereoRectify(left_camera_matrix, left_distortion,
                                                                  right_camera_matrix, right_distortion, size, R,
                                                                  T)
# 计算更正map
left_map1, left_map2 = cv2.initUndistortRectifyMap(left_camera_matrix, left_distortion, R1, P1, size, cv2.CV_16SC2)
right_map1, right_map2 = cv2.initUndistortRectifyMap(right_camera_matrix, right_distortion, R2, P2, size, cv2.CV_16SC2)
